In [1]:
import numpy as np
import pandas as pd

In [2]:
soz1 = {
    "isimler": ["mehmet","ayşe","zeynep"],
    "sporlar": ["tenis","yüzme","koşu",],
    "kaloriler":[250,350,400]
}
soz2 = {
    "isimler": ["ali","tugut","metin"],
    "sporlar": ["koşu","basketbol","koşu",],
    "kaloriler":[450,1500,200]
}
soz3 = {
    "isimler": ["gül","nur","çağla"],
    "sporlar": ["koşu","yüzme","bedminton",],
    "kaloriler":[150,125,175]
}

In [3]:
pdsoz1 = pd.DataFrame(soz1)

In [4]:
pdsoz2 = pd.DataFrame(soz2)

In [5]:
pdsoz3 = pd.DataFrame(soz3)

In [6]:
##concaniation birleştirme

In [7]:
pd.concat([pdsoz1,pdsoz2,pdsoz3])

  isimler    sporlar  kaloriler
0  mehmet      tenis        250
1    ayşe      yüzme        350
2  zeynep       koşu        400
0     ali       koşu        450
1   tugut  basketbol       1500
2   metin       koşu        200
0     gül       koşu        150
1     nur      yüzme        125
2   çağla  bedminton        175

In [8]:
merge1 = {
    "isimler":["ahmet","mehmet","cansu"],
    "kalori":[250,350,400]
}
merge2 = {
    "isimler":["ahmet","mehmet","cansu"],
    "spor":["basketbol","futbol","tenis"]
}

In [9]:
pd.DataFrame(merge1)

  isimler  kalori
0   ahmet     250
1  mehmet     350
2   cansu     400

In [10]:
pd.DataFrame(merge2)

  isimler       spor
0   ahmet  basketbol
1  mehmet     futbol
2   cansu      tenis

In [11]:
pd.merge(pd.DataFrame(merge2),pd.DataFrame(merge1),on ="isimler") #BİRLEŞTİRME FONKSİYONU. İKİ FARKLI DATAFRAME BİRLEŞTRİRZ.

  isimler       spor  kalori
0   ahmet  basketbol     250
1  mehmet     futbol     350
2   cansu      tenis     400

In [12]:
maas={
    "isimler":["mehmet","metin","ali","ayşe","tugrul"],
    "departmanlar":["YAZILIM","INSANKAYNAKLARI","FİNANS","MUHASEBE","YAZILIM"],
    "maas": [2850,2960,3150,4250,5500,]
    }

In [13]:
pdmaas = pd.DataFrame(maas)

In [14]:
pdmaas

  isimler     departmanlar  maas
0  mehmet          YAZILIM  2850
1   metin  INSANKAYNAKLARI  2960
2     ali           FİNANS  3150
3    ayşe         MUHASEBE  4250
4  tugrul          YAZILIM  5500

In [15]:
pdmaas["departmanlar"].unique() #unique degerler

array(['YAZILIM', 'INSANKAYNAKLARI', 'FİNANS', 'MUHASEBE'], dtype=object)

In [16]:
pdmaas["departmanlar"].nunique() #unique degerlerin sayısı

4

In [17]:
pdmaas["departmanlar"].value_counts()

YAZILIM            2
MUHASEBE           1
FİNANS             1
INSANKAYNAKLARI    1
Name: departmanlar, dtype: int64

In [18]:
def netmaas(maas):
    return maas*0.66

In [19]:
pdmaas["maas"].apply(netmaas) #.apply diiyerek fonksiyomları guzel birseilde uygularız

0    1881.0
1    1953.6
2    2079.0
3    2805.0
4    3630.0
Name: maas, dtype: float64

In [20]:
pdmaas.isnull()

   isimler  departmanlar   maas
0    False         False  False
1    False         False  False
2    False         False  False
3    False         False  False
4    False         False  False

In [21]:
cizgifilm = {
    "karakter": ["simpson","simpson","simpson","simpson","wahfle","wahfle","wahfle","wahfle",],
    "adlar":["henry","walk","merge","woult","coly","culter","coly","walk"],
    "yaslar":[19,22,23,24,25,26,28,30]
}

In [22]:
dfler = pd.DataFrame(cizgifilm)

In [23]:
dfler.pivot_table(values = "yaslar", index = ["karakter","adlar"],aggfunc=np.sum) #AYNI OLANLARI TOPLATMAK İSTERSEK.

                 yaslar
karakter adlar
simpson  henry       19
         merge       23
         walk        22
         woult       24
wahfle   coly        53
         culter      26
         walk        30